exampleCases/GABLS3/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../inputParameters"

application     NEWAFoamv0; 

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         $theEnd;

deltaT          $dt;

//writeControl    timeStep;
writeControl    adjustableRunTime;

writeInterval   $writeInt;

purgeWrite      3;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   12;

runTimeModifiable true;

adjustTimeStep yes; 

maxCo           $maxCFL;

maxDeltaT       $maxDeltaT;

libs    ( 
         "libincompressibleSogachevRASModel.so"
         "libincompressibleTurbulenceModelABL.so"  
         );


functions
{
    sets
    {
        type            sets;
        functionObjectLibs
        ( "libsampling.so"  );
        //interpolationScheme cellPoint;
        interpolationScheme cell;
        outputControl   outputTime;
        setFormat  raw;
		  fields         $lineZfields;
        sets
        (
            lineZ
            {
                type    midPoint;
                axis    xyz;
                start   $lineZstart;//(150.1 150.1 0);
                end     $lineZend; //(150.1 150.1 3000);
            }
        );
    }


    probes
    {
        type   probes;
        functionObjectLibs ("libsampling.so");
//        setFormat foamFile;
//        outputControl   outputTime;
        outputControl   timeStep;
//        outputInterval  1;

//        interpolationScheme        cellPoint;
        interpolationScheme        cell;
        fields          (U T k epsilon nut p);

        probeLocations
        (
            $monitoringPoint1
            $monitoringPoint2
        );
    }

}

// ************************************************************************* //
