exampleCases/GABLS3/constant/RASProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../inputParameters"

RASModel            kEpsilonSogachevPrecursor;

turbulence          on;
printCoeffs         on;

kEpsilonSogachevPrecursorCoeffs
{
    Cmu         $Cmu;
    C1          $C1;
    C2          $C2;
    sigmaEps    $sigmaEps; 
    sigmaK      $sigmaK;
    kappa       $kappa;
}

// ************************************************************************* //
