exampleCases/GABLS3/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../inputParameters"

transportModel Newtonian;

// Laminar viscosity
nu              nu [0 2 -1 0 0 0 0] $nu;

// Reference temperature
TRef            TRef [0 0 0 1 0 0 0] $TRef;

// Laminar Prandtl number
Pr              Pr [0 0 0 0 0 0 0] $Pr;

// Turbulent "static" Prandtl number
Prts             Prts [0 0 0 0 0 0 0] $Prts;


// ************************************************************************* //
