exampleCases/GABLS3/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../inputParameters"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $U0;

boundaryField
{
    #include "include/sidePatches"

    ground
    {
        type            fixedValue;    //typical approach (rchavez)
        value           uniform (0 0 0);

    }

    top       
    {    
        type            slip;
    }
}

// ************************************************************************* //
