exampleCases/GABLS3/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../inputParameters"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $p_rgh0;

boundaryField
{

    #include "include/sidePatches"

    ground
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    top
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

}

// ************************************************************************* //
