exampleCases/GABLS3/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T ;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../inputParameters"

 
dimensions      [0 0 0 1 0 0 0];
 
internalField   uniform $TBottom;

boundaryField
{
	#include "include/sidePatches"

    ground
    {
        type            zeroGradient;
    }
    top
    {
        type            fixedGradient;
        gradient        uniform $TGradUpper;
    }

}


// ************************************************************************* //
