exampleCases/GABLS3/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../inputParameters"

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform $alphat0;

boundaryField
{
    #include "include/sidePatches"

    ground
    {

        type            fixedValue;   //Mat stuff sowfa
        value           uniform 0.0;

/*
        type            alphatAtmWallFunction;
        #include "include/SBLparameters"
        value           uniform 0.2;
*/
    }

    top
    {
/*        
        type            calculated;
        value           uniform 0;
*/
        type            slip;

/*
        type            fixedValue;   //Mat stuff sowfa
        value           uniform 0.0;
*/
    }


}
// ************************************************************************* //
