exampleCases/GABLS3/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../inputParameters"

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $tdr0;

boundaryField
{
    #include "include/sidePatches"

    ground
    {
         type            epsilonAtmWallFunction;
         #include "include/SBLparameters"
         value           uniform 2;
    }

    top       
    {    
        type            slip;
    }
}

// ************************************************************************* //
