exampleCases/GABLS3/0.orig/include/SBLparameters
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

//#include "../../inputParameters"

Cmu             $Cmu;
kappa           $kappa;
Prts            $Prts;

// ************************************************************************* //
