exampleCases/GABLS3/0.orig/include/sidePatches
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


inlet
{
    type            cyclic;
}

outlet
{
    type            cyclic;
}

wall_1
{
    type            cyclic;
}

wall_2
{
    type            cyclic;
}

// ************************************************************************* //
