exampleCases/GABLS3/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../inputParameters"

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{

	#include "include/sidePatches"


    ground
    {
//        type            zeroGradient;

		type            nutAtmWallFunction;
      #include "include/SBLparameters"
		value           uniform 2.0;
    }

    top
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
