exampleCases/GABLS3/0.orig/qwall
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      qwall;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../inputParameters"

dimensions      [ 0 1 -1 1 0 0 0 ];

internalField   uniform (0.0 0.0 0.0);

boundaryField
{

    #include "include/sidePatches"

	ground
	{
		type            specifiedSurfaceTemperatureq2;
		kappa           $kappa;
		z0              uniform $z0;
		betaM           $betaM;
		gammaM          $gammaM;
		betaH           $betaH;
		gammaH          $gammaH;
		alphaH          $alphaH;
		averageType     "planarAverage";
		value           uniform $qwall;
		TSurface        csvFile;
      TSurfaceCoeffs
      {
         fileName           "forcing/surfaceSkinPotentialTemperatureTable";		  
         nHeaderLine         0;
         refColumn           0;
         componentColumns    (1);
         mergeSeparators     yes;
         outOfBounds         clamp;
		}


    }

    top
    {
        type            fixedValue;
        value           $internalField;
    }
}


// ************************************************************************* //
