exampleCases/GABLS3/0.orig/z0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      z0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../inputParameters"

dimensions      [0 1 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #include "include/sidePatches"

    ground
    {
        type            fixedValue;
        value           uniform $z0;
    }

    top       
    {    
        type            zeroGradient;
    }

}

// ************************************************************************* //
