exampleCases/GABLS3/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../inputParameters"

solvers
{
    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0.01;
        maxIter         1000;

        /*
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-05;
            relTol          0.01;
            smoother        DICGaussSeidel;
            nPreSweeps      0;
            nPostSweeps     2;
            nFinestSweeps   2;
            cacheAgglomeration true;
            nCellsInCoarsestLevel 100;
            agglomerator    faceAreaPair;
            mergeLevels     2;
        }
        tolerance       1e-06;
        relTol          0.01;
        maxIter         1000;
        */

    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0.0;
    }

    "(U|T|k|epsilon|R)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
        maxIter         1000; //MChurch
    }

    "(U|T|k|epsilon|R)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    turbOnFinalIterOnly       $turbOnFinalIterOnly;
    momentumPredictor         $momentumPredictor;
    nOuterCorrectors          $nOuterCorrectors;
    nCorrectors               $nCorrectors;
    nNonOrthogonalCorrectors  0;
    pRefCell                  0;
    pRefValue                 0;

/*
    residualControl    // values suggested by Holzman
    {
        U
        {
            tolerance  1e-4;
            relTol      0;
        }
        p
        {
            tolerance  5e-5;
            relTol      0;
        }
     }
*/
}

relaxationFactors
{
    fields
    {
//	p             1;
//	pFinal        1;            //last outer loop
    }
    equations
    {
        "(U|T|k|epsilon|R)"       1.0;
        "(U|T|k|epsilon|R)Final"  1.0;  //last outer loop
    }
}

// ************************************************************************* //
