exampleCases/GABLS3/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../inputParameters"

numberOfSubdomains  $nCores;

method          $decompType;
//preservePatches (inlet outlet wall_1 wall_2);


hierarchicalCoeffs
{
    n               $decompOrder;
    delta           0.001;
    order           xyz;
}



simpleCoeffs
{
    n           $decompOrder;
    delta       0.001;
}



// ************************************************************************* //
